/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50721
 Source Host           : localhost
 Source Database       : 54

 Target Server Type    : MySQL
 Target Server Version : 50721
 File Encoding         : utf-8

 Date: 04/25/2018 22:40:33 PM
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `event`
-- ----------------------------
DROP TABLE IF EXISTS `event`;
CREATE TABLE `event` (
  `year` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `event` varchar(500) COLLATE utf8mb4_bin NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=85 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
--  Records of `event`
-- ----------------------------
BEGIN;
INSERT INTO `event` VALUES ('2018', '展望2018，我们将喜迎改革开放40周年，共同为党和国家事业贡献智慧和力量。', '44'), ('2017', '回眸2017，我们为党的十九大胜利召开欢呼，也为香港回归祖国20周年喝彩。', '45'), ('2016', '那一年，我们纪念建党95周年、长征胜利80周年，见证G20峰会举办，女排奥运夺冠。', '46'), ('2015', '那一年，我们为抗战胜利70周年欢呼，也为北京申办2022年冬奥会成功而喝彩。', '47'), ('2014', '那一年，我们见证全面深化改革元年的开启，抗战胜利纪念日和国家公祭日的设立。', '48'), ('2013', '那一年，我们为神十天宫对接、嫦娥玉兔奔月欢呼，也为“一带一路”战略喝彩。', '49'), ('2012', '那一年，我们为党的十八大胜利召开欢呼，也为中国“航母style”的炫酷喝彩。', '50'), ('2011', '那一年，我们庆祝建党90周年，纪念辛亥革命100周年，见证“十二五”规划启航。', '51'), ('2010', '那一年，我们共同为战胜玉树地震贡献力量，也为上海世博、广州亚运奉献青春。', '52'), ('2009', '那一年，我们为建国60周年欢呼，也为一个叫“双十一”的购物狂欢节喝彩。', '53'), ('2008', '那一年，我们抗击汶川地震，携手北京奥运；那一年，我们见证改革开放30周年。', '54'), ('2007', '那一年，我们为党的十七大胜利召开欢呼，也为香港回归祖国10周年而喝彩。', '55'), ('2006', '那一年，我们见证了三峡大坝建成并蓄水至156米，也见证了青藏铁路全线通车。', '56'), ('2005', '那一年，我们纪念抗战胜利60周年，见证“神六”飞天，青藏铁路全线铺通。', '57'), ('2004', '那一年，我们共同见证了雅典奥运会上中国代表团勇夺金牌榜第二名的荣耀。', '58'), ('2003', '那一年，我们为抗击“非典”贡献力量；那一年，我们为“神五”飞天欣喜若狂。', '59'), ('2002', '那一年，我们为党的十六大胜利召开欢呼，也为国足参赛世界杯决赛而喝彩。', '60'), ('2001', '那一年，我们一起庆祝党的80岁生日，共同见证北京申奥成功、中国成功\"入世\"。', '61'), ('2000', '那一年，我们为国家西部大开放战略的全面实施欢呼，也为新世纪的到来喝彩。', '62'), ('1999', '那一年，我们庆祝建国50周年、澳门回归；那一年，我们与一个叫QQ的企鹅聊上了。', '63'), ('1998', '那一年，我们为抗击特大洪水助力；那一年，我们围坐一团，观看《还珠格格》。', '64'), ('1997', '那一年，我们庆祝党的十五大胜利召开，也见证了香港回归、三峡大江成功截流。', '65'), ('1996', '那一年，我们共同见证了亚特兰大奥运会上中国代表团勇夺金牌榜第四名的荣耀。', '66'), ('1995', '那一年，我们纪念抗战胜利50周年，见证京九铁路全线铺通和国家双休日的实行。', '67'), ('1994', '那一年，我们见证了三峡工程建设开工；那一年，《焦点访谈》走进了我们生活。', '68'), ('1993', '那一年，我们为北京申奥惜败遗憾;那一年，我们隆重纪念毛泽东同志诞辰100周年。', '69'), ('1992', '那一年，我们庆祝党的十四大胜利召开；那一年，《圣斗士星矢》走进了我们生活。', '70'), ('1991', '那一年，我们庆祝建党70周年；那一年，一个叫哆啦A梦的蓝胖子走进了我们生活。', '71'), ('1990', '那一年，我们最喜欢熊猫盼盼，最爱听《亚洲雄风》，最爱给北京亚运加油喝彩。', '72'), ('1989', '那一年，我们庆祝建国50周年，见证葛洲坝水利枢纽的建成和“希望工程”的实施。', '73'), ('1988', '那一年，我们为中国改革开放10周年欢呼，也见证了亚洲人口的总数达到30亿。', '74'), ('1987', '那一年，我们为党的十三大胜利召开欢呼，也见证了中国第一封电子邮件的发出。', '75'), ('1986', '那一年，我们为中国女排勇夺五年冠欢呼，也为经典电视剧《西游记》的开播喝彩。', '76'), ('1985', '那一年，我们见证了中国成为国际原子能机构成员国，也为第一个教师节送上了祝福。', '77'), ('1984', '那一年，我们为建国35周年欢呼，也为许海峰勇夺中国奥运历史上第一枚金牌喝彩。', '78'), ('1983', '那一年，我们欢聚除夕，围坐一团，共同观看中央电视台首届春节联欢晚会直播。', '79'), ('1982', '那一年，我们庆祝党的十二大召开，也为中国首夺汤姆斯杯、世锦赛李宁夺6金喝彩。', '80'), ('1981', '那一年，我们共同庆祝中国共产党成立60周年，见证中国民航首航美国纽约成功。', '81'), ('1980', '那一年，我们见证了中国独立自主研发第一架大型远程喷射客机运-10首非成功。', '82'), ('1979', '那一年，我们共同为建国50周年欢呼，也为中国女排首夺亚洲锦标赛冠军喝彩。', '83'), ('1978', '那一年，我们共同见证中国共产党第十一届三中全会胜利召开，改革开放政策实施。', '84');
COMMIT;

-- ----------------------------
--  Table structure for `story`
-- ----------------------------
DROP TABLE IF EXISTS `story`;
CREATE TABLE `story` (
  `keyword` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `describe` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
--  Records of `story`
-- ----------------------------
BEGIN;
INSERT INTO `story` VALUES ('快乐', '高举团旗跟党走！志存高远，脚踏实地，努力在实现中华民族伟大复兴的中国梦的生动实践中放飞青春梦想。', '16'), ('温暖', '自觉锤炼自己、提高自己。勇担历史使命，在激扬青春、开拓人生、奉献社会的进程中书写无愧于时代的壮丽篇章。', '17'), ('精彩', '充分展现自己的抱负和激情，胸怀理想、锤炼品格，脚踏实地、艰苦奋斗，不断书写奉献青春的时代篇章。', '18'), ('自信', '增强责任感和使命感，勇于创新，报效祖国，把人生理想融入为实现中华民族伟大复兴的中国梦的奋斗中。', '19'), ('自豪', '在实现中国梦的伟大征程上，勇做走在时代前列的奋进者、开拓者、奉献者，书写无愧于时代的青春之歌和精彩人生。', '20'), ('光荣', '积极践行社会主义核心价值观，牢固树立与这个时代主题同心同向的理想信念，勇于担当这个时代赋予的历史责任。', '21'), ('炫酷', '坚定理想信念、练就过硬本领、勇于创新创造、矢志艰苦奋斗、锻炼高尚品格，为实现中国梦奉献智慧和力量。', '22'), ('无悔', '立足本职、埋头苦干，从自身做起，从点滴做起，用勤劳的双手、一流的业绩成就属于自己的人生精彩。', '23'), ('美丽', '在感悟时代、紧跟时代中珍惜韶华，把自己的爱国之情、强国之志、报国之行统一起来，让中国梦激扬青春梦。', '24'), ('昂扬', '把自己的人生追求同国家发展进步、人民伟大实践紧密结合起来，刻苦学习，脚踏实地，锐意进取。', '25'), ('幸福', '做到志存高远、德才并重、情理兼修、勇于开拓，在火热的青春中放飞人生梦想，在拼搏的青春中成就事业华章。', '26'), ('感动', '把自己的爱国之情、强国之志、报国之行统一起来，努力使自己成为祖国建设的有用之才、栋梁之才。', '27'), ('给力', '树立正确的世界观、人生观、价值观。把自己的梦想融入实现中国梦的奋斗之中，不断书写奉献青春的时代篇章。', '28'), ('激情', '以执着的信念、优良的品德、丰富的知识、过硬的本领，担负起历史重任，让五四精神放射出更加夺目的时代光芒。', '29');
COMMIT;

-- ----------------------------
--  Table structure for `users`
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `openid` varchar(255) DEFAULT NULL,
  `nickname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `imgurl` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `openid` (`openid`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `users`
-- ----------------------------
BEGIN;
INSERT INTO `users` VALUES ('1', 'ouRCyjhdsj8RQofIOPHc7nX9hA983', '知识混子周政3', 'https://t10.baidu.com/it/u=3853267335,1610233051&fm=173&app=25&f=JPEG?w=550&h=294&s=DE7A7DCA02738DD644C1A112030000D3');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
